[
  {
    "serviceId": 1,
    "serviceName": "Winter Coat Fitting for Dogs",
    "providerName": "PawCare Studio",
    "providerEmail": "info@pawcare.com",
    "price": 25,
    "rating": 4.9,
    "slotsAvailable": 4,
    "description": "When temperatures drop, every dog deserves to stay warm without losing its sense of adventure or comfort. Our Winter Coat Fitting for Dogs service offers personalized fittings to ensure every pet enjoys the perfect balance of warmth, mobility, and style. At PawCare Studio, we understand that each breed has unique needs — short-haired dogs require more insulation, while long-haired breeds need breathable yet cozy materials. That’s why we tailor every coat to match your pet’s exact body shape and activity level. Our premium winter wear collection features water-resistant fabrics, adjustable straps, soft linings, and reflective stitching for nighttime safety. We take precise measurements to eliminate tightness around the chest or neck while ensuring full range of motion. Beyond functionality, our fittings are about confidence and joy — your dog will not only feel comfortable but also look charming in our winter collection. Whether it’s a quick walk in the park or a snowy hike, our coats keep your furry friend safe from cold winds, dampness, and frostbite. We also educate pet owners about coat maintenance and layering options, ensuring long-lasting comfort all winter long. With PawCare Studio, every dog gets the luxury of warmth and the elegance of style.",
    "image": "https://i.ibb.co.com/b5hgPYZM/winter.jpg",
    "category": "Clothing"
  },
  {
    "serviceId": 2,
    "serviceName": "Winter Grooming & Paw Treatment",
    "providerName": "CozyPets Grooming",
    "providerEmail": "hello@cozypets.com",
    "price": 30,
    "rating": 4.8,
    "slotsAvailable": 3,
    "description": "Winter brings joy and snuggles — but also dry air, flaky skin, and cracked paws for pets. Our Winter Grooming & Paw Treatment service, offered by CozyPets Grooming, is designed to restore hydration and maintain coat health during the cold months. Each session includes a thorough grooming process with winter-formulated, moisture-rich shampoos and conditioners that lock in natural oils and keep fur silky. Our professional groomers use gentle techniques that prevent static buildup, ensuring your pet’s coat remains soft and manageable even in low humidity. The highlight of the session is our moisturizing paw treatment: we apply a blend of natural balms containing shea butter, aloe vera, and vitamin E to soothe and heal cracked pads. For active dogs who enjoy outdoor walks, we offer a special snow-protection balm that creates a breathable barrier against ice, salt, and road chemicals. The session concludes with a warm towel wrap that helps pets relax and improves circulation. Our team also provides personalized tips for at-home grooming, including how to brush correctly, manage shedding, and maintain paw moisture. At CozyPets Grooming, every furry client leaves feeling refreshed, nourished, and ready to conquer the cold.",
    "image": "https://i.ibb.co.com/WpWxt7XQ/grooming.webp",
    "category": "Grooming"
  },
  {
    "serviceId": 3,
    "serviceName": "Thermal Bedding Setup",
    "providerName": "SnuggleTails",
    "providerEmail": "contact@snuggletails.com",
    "price": 40,
    "rating": 4.7,
    "slotsAvailable": 5,
    "description": "Comfort is essential during the winter months, and our Thermal Bedding Setup ensures your pet enjoys the warmth and security they deserve. SnuggleTails specializes in creating cozy sleeping spaces tailored to your pet’s needs — whether it’s a small cat curled up in a corner or a large dog sprawling across the floor. Each setup features layered, thermal-insulated bedding with adjustable warmth levels. We use breathable materials that trap heat while allowing airflow, preventing overheating or dampness. Our bedding options include orthopedic padding for senior pets, hypoallergenic covers for sensitive ones, and eco-friendly fabrics for sustainable comfort. Beyond just a bed, we design an entire rest environment — positioning it away from cold drafts, choosing calming textures, and adding soft blankets that mimic natural fur comfort. SnuggleTails also offers a maintenance guide, teaching pet owners how to wash and refresh bedding without losing insulation quality. The result is a sleep sanctuary where your pet feels safe, warm, and deeply relaxed. Our goal is to make cold nights cozy and restful, giving your furry friend the sleep they need to stay healthy and energetic all winter long.",
    "image": "https://i.ibb.co.com/XGzGs04/thermal.jpg",
    "category": "Comfort"
  },
  {
    "serviceId": 4,
    "serviceName": "Winter Nutrition Consultation",
    "providerName": "PawThrive Clinic",
    "providerEmail": "care@pawthrive.com",
    "price": 35,
    "rating": 4.9,
    "slotsAvailable": 6,
    "description": "Nutrition is the foundation of health, especially during the colder months when pets burn extra calories to stay warm. Our Winter Nutrition Consultation, conducted by PawThrive Clinic, is a comprehensive diet planning service tailored to your pet’s breed, age, and energy level. Our experienced veterinarians and nutritionists analyze your pet’s current eating habits, weight trends, and activity patterns to create a customized winter meal plan. The goal is to strengthen immunity, enhance metabolism, and maintain optimal body condition throughout the season. We recommend nutrient-rich foods with healthy fats, proteins, and essential vitamins to support coat shine, joint flexibility, and overall vitality. Special focus is given to hydration since many pets drink less water during winter — our experts suggest moisture-enhancing meals and safe broths to prevent dehydration. For pets with allergies or specific health concerns, we design specialized diet adjustments using natural ingredients. PawThrive also guides owners on portion control, snack management, and the importance of vitamin D during limited sunlight periods. Every consultation ends with a detailed nutrition chart, winter feeding tips, and follow-up support. It’s more than a diet — it’s a lifestyle transformation that keeps your pet glowing with health even in the frostiest weather.",
    "image": "https://i.ibb.co.com/fWfTrGN/nutration1.png",
    "category": "Health"
  },
  {
    "serviceId": 5,
    "serviceName": "Snow Walk Training & Safety Session",
    "providerName": "FurSteps Academy",
    "providerEmail": "support@fursteps.com",
    "price": 28,
    "rating": 4.8,
    "slotsAvailable": 4,
    "description": "Walking in snow can be a thrilling experience for dogs — but it also requires proper training and safety awareness. Our Snow Walk Training & Safety Session, provided by FurSteps Academy, helps dogs adapt confidently to winter terrains while keeping them safe from cold-related hazards. Professional trainers use positive reinforcement techniques to gradually introduce pets to snow surfaces, icy textures, and new temperature sensations. The session teaches dogs how to walk safely without slipping, recognize unsafe areas like frozen ponds, and respond calmly to sudden weather changes. Owners also learn how to choose suitable winter gear — from protective booties to reflective leashes for low-light conditions. The training includes exercises that build muscle warmth, improve endurance, and enhance paw grip. For young or timid dogs, we offer gentle acclimation methods to boost confidence during snowy outings. FurSteps Academy also emphasizes post-walk care, teaching owners how to clean and inspect paws to avoid salt burns or frostbite. By the end of the program, both pet and owner feel ready for joyful, worry-free winter walks. It’s not just about training — it’s about bonding through trust, safety, and fun in the snow.",
    "image": "https://i.ibb.co.com/xSrxyC9n/snowwalk2.png",
    "category": "Training"
  },
  {
    "serviceId": 6,
    "serviceName": "Pet Spa & Hot Towel Therapy",
    "providerName": "WarmWhiskers Spa",
    "providerEmail": "booking@warmwhiskers.com",
    "price": 45,
    "rating": 5.0,
    "slotsAvailable": 2,
    "description": "There’s nothing quite like a warm spa day to chase away the winter chill. At WarmWhiskers Spa, our Pet Spa & Hot Towel Therapy service delivers a luxurious experience that rejuvenates your pet’s body and mind. The session begins with a gentle brushing to remove loose fur and stimulate circulation, followed by a warm towel wrap that instantly relaxes muscles and soothes stiffness caused by cold weather. Our spa experts use aromatherapy oils and hypoallergenic conditioners designed specifically for pets, leaving the coat shiny and the skin deeply nourished. Hot towel therapy enhances blood flow, promotes relaxation, and reduces joint discomfort — especially beneficial for older pets or those with arthritis. Each spa day also includes a mini massage that releases tension and boosts energy. To complete the pampering, we offer coat conditioning treatments and light detangling for a smooth, polished finish. The environment is calm, fragrant, and stress-free — perfect for anxious pets needing comfort. We also advise owners on how to maintain post-spa care at home with safe, natural products. WarmWhiskers Spa is more than grooming; it’s a wellness retreat where pets are treated with love, warmth, and holistic care during the coldest months of the year.",
    "image": "https://i.ibb.co.com/VcP219GY/petSpa.jpg",
    "category": "Wellness"
  },
  {
    "serviceId": 7,
    "serviceName": "Indoor Exercise & Play Program",
    "providerName": "ActivePaws Indoor Center",
    "providerEmail": "play@activepaws.com",
    "price": 32,
    "rating": 4.8,
    "slotsAvailable": 8,
    "description": "When winter weather makes outdoor exercise challenging, our Indoor Exercise & Play Program keeps your pet active, engaged, and healthy. ActivePaws Indoor Center offers a climate-controlled facility with obstacle courses, agility equipment, interactive toys, and supervised play sessions designed to burn energy and maintain fitness. Our certified trainers create customized workout routines based on your pet's age, breed, and stamina level. Sessions include treadmill training for cardiovascular health, balance exercises for coordination, and mental stimulation games that challenge problem-solving skills. We understand that winter inactivity can lead to weight gain, boredom, and behavioral issues — our program prevents all three. Group play sessions allow socialization with other pets in a safe, monitored environment. For high-energy breeds, we offer extended sessions with sprint tracks and fetch zones. Senior pets benefit from gentle movement therapy that maintains joint flexibility without strain. Every session ends with a cooldown period and fresh water. Owners receive progress reports and at-home exercise suggestions to complement facility visits. At ActivePaws, we believe winter shouldn't limit your pet's vitality — it should simply move the fun indoors.",
    "image": "https://images.unsplash.com/photo-1548199973-03cce0bbc87b?w=800",
    "category": "Fitness"
  },
  {
    "serviceId": 8,
    "serviceName": "Winter Wellness Checkup",
    "providerName": "FrostGuard Veterinary",
    "providerEmail": "appointments@frostguard.vet",
    "price": 50,
    "rating": 4.9,
    "slotsAvailable": 5,
    "description": "Prevention is the best medicine, especially during winter when cold weather can exacerbate existing health conditions. Our Winter Wellness Checkup at FrostGuard Veterinary provides comprehensive health screening to ensure your pet thrives throughout the season. The examination includes temperature regulation assessment, joint mobility testing, skin and coat evaluation, and respiratory system checks. Our veterinarians look for early signs of arthritis flare-ups, dry skin conditions, and cold-related stress. We measure body weight and condition score to adjust nutrition plans if needed. Blood work options are available to monitor organ function and detect vitamin deficiencies common in winter months. For senior pets, we pay special attention to circulation issues and decreased immunity. The checkup also covers dental health, as many owners overlook oral care during colder months. We provide personalized winter care plans that include supplement recommendations, exercise guidelines, and environmental adjustments for home safety. FrostGuard Veterinary believes in proactive care — catching potential problems before they become serious. Every pet receives a detailed health report and a follow-up consultation schedule. It's peace of mind knowing your beloved companion is winter-ready and medically sound.",
    "image": "https://images.unsplash.com/photo-1576201836106-db1758fd1c97?w=800",
    "category": "Health"
  },
  {
    "serviceId": 9,
    "serviceName": "Heated Pet House Installation",
    "providerName": "CozyDen Solutions",
    "providerEmail": "install@cozyden.com",
    "price": 85,
    "rating": 4.7,
    "slotsAvailable": 3,
    "description": "Outdoor pets deserve warmth and protection from harsh winter elements. Our Heated Pet House Installation service by CozyDen Solutions provides safe, energy-efficient shelter that maintains comfortable temperatures even during freezing nights. Each installation begins with site assessment to determine optimal placement away from wind exposure and moisture. We offer insulated pet houses with built-in heating panels that self-regulate based on outdoor temperature — never too hot, never too cold. Our designs feature elevated floors to prevent ground chill, weatherproof exteriors that withstand snow and rain, and ventilation systems that ensure fresh air circulation. Interior spaces include removable thermal bedding, non-slip flooring, and easy-access doors with draft-blocking flaps. Safety is paramount — all electrical components are pet-proof with chew-resistant wiring and automatic shut-off features. We customize sizes for different breeds and multiple-pet households. Installation includes waterproofing treatment, anchoring for stability during storms, and a demonstration of maintenance procedures. CozyDen also provides energy consumption estimates and seasonal adjustment tips. For barn cats, backyard dogs, or outdoor working animals, our heated houses offer sanctuary and security. It's not just shelter — it's a warm haven where outdoor pets find comfort and protection all winter long.",
    "image": "https://images.unsplash.com/photo-1585664811087-47f65abbad64?w=800",
    "category": "Shelter"
  },
  {
    "serviceId": 10,
    "serviceName": "Anxiety-Relief Aromatherapy Session",
    "providerName": "TranquilPaws Wellness",
    "providerEmail": "relax@tranquilpaws.com",
    "price": 38,
    "rating": 4.9,
    "slotsAvailable": 4,
    "description": "Winter's shorter days and indoor confinement can trigger anxiety and restlessness in sensitive pets. Our Anxiety-Relief Aromatherapy Session at TranquilPaws Wellness uses natural, pet-safe essential oils to promote calmness, reduce stress, and improve emotional balance. Certified aromatherapists create custom blends based on your pet's temperament and specific anxiety triggers — whether it's separation anxiety, storm phobia, or general nervousness. We use gentle diffusion methods in controlled environments, never applying oils directly to skin. Calming scents like lavender, chamomile, and frankincense work with your pet's natural senses to induce relaxation without sedation. Each session includes a quiet space with soft lighting, comfortable bedding, and soothing background sounds. Our specialists observe behavioral responses and adjust aromatherapy intensity accordingly. The treatment pairs beautifully with gentle massage and breathing exercises that deepen relaxation. For pets with chronic anxiety, we design take-home aromatherapy kits with diffuser recommendations and usage guidelines. Owners learn to recognize stress signals and implement calming routines during difficult moments. TranquilPaws believes in holistic wellness — addressing emotional health alongside physical care. After each session, pets exhibit improved sleep quality, reduced destructive behaviors, and a more peaceful demeanor throughout winter's challenging months.",
    "image": "https://images.unsplash.com/photo-1587300003388-59208cc962cb?w=800",
    "category": "Wellness"
  },
  {
    "serviceId": 11,
    "serviceName": "Winter Photography Session",
    "providerName": "SnowPaws Photography",
    "providerEmail": "capture@snowpaws.photo",
    "price": 60,
    "rating": 5.0,
    "slotsAvailable": 3,
    "description": "Winter creates magical backdrops perfect for capturing your pet's personality and beauty. Our Winter Photography Session by SnowPaws Photography specializes in creating stunning portraits that celebrate the season's charm while showcasing your furry companion's unique character. Professional pet photographers work in both outdoor winter wonderlands and cozy indoor studios with seasonal props and warm lighting. We understand animal behavior and use patience, treats, and play to capture authentic expressions — joyful jumps in snow, peaceful moments by fireplaces, or playful interactions with winter accessories. Each session includes wardrobe consultation for pets wearing festive sweaters or elegant winter coats, though natural beauty is always celebrated. We scout safe locations with beautiful scenery — snow-covered parks, frosted forests, or decorated urban settings. For anxious pets, we offer familiar environment sessions at your home with portable studio equipment. The photography package includes professional editing, color correction, and artistic filters that enhance winter atmosphere without losing natural authenticity. Clients receive high-resolution digital images perfect for holiday cards, social media, or framed keepsakes. SnowPaws also offers multi-pet family sessions and action shots for athletic dogs. These aren't just photos — they're timeless memories preserving the joy and beauty of winter companionship.",
    "image": "https://images.unsplash.com/photo-1530281700549-e82e7bf110d6?w=800",
    "category": "Photography"
  },
  {
    "serviceId": 12,
    "serviceName": "Emergency Winter Pet Kit Assembly",
    "providerName": "PrepPaws Safety",
    "providerEmail": "safety@preppaws.com",
    "price": 55,
    "rating": 4.8,
    "slotsAvailable": 7,
    "description": "Winter storms can strike unexpectedly, leaving families stranded without power or access to supplies. Our Emergency Winter Pet Kit Assembly service from PrepPaws Safety ensures you're fully prepared to care for your pet during any winter emergency. Each custom kit contains essential supplies calculated for your pet's size, dietary needs, and medical requirements. We include a 7-day food supply in sealed containers, portable water purification tablets, collapsible bowls, thermal blankets, and battery-operated heating pads. Medical essentials feature a first-aid kit with bandages, antiseptic, tweezers, and any prescription medications your pet requires. For identification purposes, we add waterproof ID tags, recent photos, and medical record copies in sealed pouches. Comfort items include favorite toys, calming treats, and familiar-scented blankets to reduce stress during emergencies. Our kits also contain LED collar lights, reflective leashes, pet-safe ice melt, and paw protection wax. We provide detailed instruction cards covering hypothermia recognition, frostbite treatment, and emergency shelter creation. PrepPaws educates owners on evacuation planning, including pet-friendly shelter locations and transport carrier preparation. Each kit comes in a durable, waterproof bag that's easy to grab during urgent situations. Winter preparedness isn't paranoia — it's responsible pet ownership that could save lives when disaster strikes.",
    "image": "https://images.unsplash.com/photo-1623387641168-d9803ddd3f35?w=800",
    "category": "Safety"
  }
]
